const About = () => {
    return (
        <main className="w-full bg-white dark:bg-zinc-800">
            <div className="dark:text-white w-4/5 py-12 mx-auto">
                <h2 className="text-2xl my-3 font-medium">Предистория</h2>
                <p>Давным давно, когда солнце было светлее, трава зеленее, а небо голубее разработчикам не нужен был опыт работы, чтобы их взяли на первую работу. Но потом (доподлинно не ясно, что на это повлияло), мир разделился на до и после.
                    С тех самых времён начинающие разработчики пытались всяческе изощриться и придумать способ заполнить графу "Опыт работы"
                    в своём резюме, чтобы он смог прокормить себя, кота и, возможно, семью. Но это давалоьсь не каждому. В руках у тёмных сил были нескончаемые возможности: путём обмана негодники выдавали себя за сеньёров. Были и светлые стажёры, что изнурительным трудом добивались признания работодателя. Были и третьи со своими пет-проектами, которые делались для закрепления, но неожиданно становились "Коммерческим продуктом, который к сожалению не окупил себя". Это пет-проект кто не понял.</p>
                <hr className="mt-4" />

                <h2 className="text-2xl my-3 font-medium">Используемые технлогии</h2>
                <p>Поюзано: HTML/CSS, React, React Router, Tailwind CSS, Recharts, Vite. Еще иконки с
                    <a className="text-lime-500" href="https://www.flaticon.com/ru/"> флатикона</a>,
                    а сам API погоды абсолбтно бесплатно был взят у
                    <a className="text-lime-500" href="https://www.visualcrossing.com/resources/documentation/weather-data/weather-data-documentation/"> VISUAL CROSSING WEATHER</a>.</p>
                <hr className="mt-4" />

                <h2 className="text-2xl my-3 font-medium">О разработчике</h2>
                <p>Реактёр-фронтендер-кофеман-студентик-верстальщик-прогер-какхотитеназывайте</p>
                <hr className="mt-4" />

                <h2 className="text-2xl my-3 font-medium">Планы на будущее :)</h2>
                <p>Развитие развитие развитие</p>
                <ul className="ml-4">
                    <li>- Web GL (возможно вместо иконок, возможно вместо недостающих исконок, абсолютно точно для анимаций)</li>
                    <li>- D3.js (Неочень нравится recharts, но что есть то есть)</li>
                    <li>- Норм дизайн? ну да надо бы</li>
                </ul>
                <hr className="mt-4" />
            </div>
        </main>
    );
}

export default About;